Documents/ЛБ_УстановитьТекущийШаблонПриказа_Металлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьТекущийШаблонПриказа_Металлы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказа</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ТекущийШаблонПриказаАкции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовМеталлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПриказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныАкция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ШаблоныПриказовМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_ШаблоныПриказовМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ШаблоныПриказовМеталлы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформацияМеталлы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_УстановитьТекущийШаблонПриказа_Металлы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Параметры.Свойство("ВидОперации") Тогда
			Объект.ВидОперации = Параметры.ВидОперации; 
		Иначе
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
		КонецЕсли;  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;                
	
    УстановитьСостояниеДокумента();   
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость() 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Элементы.ШаблоныАкция.Видимость = ложь;
		Элементы.Шаблон.Видимость = Истина; 
		Элементы.СписокЛомбардов.Видимость = Истина;
	Иначе   
		Элементы.ШаблоныАкция.Видимость = Истина;
		Элементы.Шаблон.Видимость = ложь;  
		Элементы.СписокЛомбардов.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	Объект.Шаблон = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПриказовМеталлы.ПустаяСсылка");
	Объект.ШаблоныАкция.Очистить();  
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	Объект.СтрокаЛомбарды = СписокЛомбардов;
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись тогда
		Возврат;
	КонецЕсли;		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Базовый") Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.Шаблон) Тогда  
			Сообщить("Не выбран шаблон!"); 
			Отказ = Истина;
		КонецЕсли;	
	Иначе        
		ВсеОК = Истина;    
		Для каждого Стр из Объект.ШаблоныАкция Цикл 
			Если НЕ ЗначениеЗаполнено(Стр.Акция) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не заполнена акция!"); 
				ВсеОК = ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Стр.Шаблон) Тогда  
				Сообщить("Ошибка заполнения. В строке № " + Строка(Стр.НомерСтроки) + " не выбран шаблон!"); 
				ВсеОК = ложь;
			КонецЕсли;
		КонецЦикла;	
        Если НЕ ВсеОК Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	    
КонецПроцедуры

&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
КонецПроцедуры	
 
&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	Элементы.СписокЛомбардов.Подсказка = Элементы.СписокЛомбардов.Заголовок;
КонецПроцедуры
